; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - counter
	)
  (:init
		(= (value c0) 38)
	(= (value c1) 17)
	(= (value c2) 6)
	(= (value c3) 55)
	(= (value c4) 20)
	(= (value c5) 91)
	(= (value c6) 13)
	(= (value c7) 89)
	(= (value c8) 36)
	(= (value c9) 86)
	(= (value c10) 45)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
		)
	)
)

; plan
1. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 4 of 10
2. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 4 of 10
3. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 4 of 10
4. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 4 of 10
5. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 4 of 10
6. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 4 of 10
7. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 10
8. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 10
9. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 10
10. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 4 of 10
11. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 4 of 10
12. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 4 of 10
13. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 4 of 10
14. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 10
15. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 10
16. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 4 of 10
17. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 4 of 10
18. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 10
19. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 10
20. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 10
21. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 4 of 10
22. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 4 of 10
23. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 4 of 10
24. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 4 of 10
25. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 4 of 10
26. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 4 of 10
27. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 4 of 10
28. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 4 of 10
29. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 4 of 10
30. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 4 of 10
31. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 10
32. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 4 of 10
33. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 10
34. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 10
35. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 4 of 10
36. (increment c2)
   changed: (value c2) from 6 to 11
   goals met: 4 of 10
37. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 10
38. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 10
39. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 10
40. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 10
41. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 10
42. (increment c1)
   changed: (value c1) from 17 to 23
   goals met: 4 of 10
43. (increment c2)
   changed: (value c2) from 11 to 16
   goals met: 4 of 10
44. (increment c4)
   changed: (value c4) from 20 to 26
   goals met: 4 of 10
45. (increment c4)
   changed: (value c4) from 26 to 32
   goals met: 4 of 10
46. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 10
47. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 10
48. (increment c4)
   changed: (value c4) from 32 to 38
   goals met: 4 of 10
49. (increment c4)
   changed: (value c4) from 38 to 44
   goals met: 4 of 10
50. (increment c4)
   changed: (value c4) from 44 to 50
   goals met: 4 of 10
51. (increment c4)
   changed: (value c4) from 50 to 56
   goals met: 5 of 10
52. (increment c2)
   changed: (value c2) from 16 to 21
   goals met: 5 of 10
53. (increment c2)
   changed: (value c2) from 21 to 26
   goals met: 6 of 10
54. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 6 of 10
55. (increment c1)
   changed: (value c1) from 23 to 30
   goals met: 5 of 10
56. (increment c2)
   changed: (value c2) from 26 to 31
   goals met: 6 of 10
57. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 6 of 10
58. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 6 of 10
59. (increment c10)
   changed: (value c10) from 45 to 52
   goals met: 6 of 10
60. (increment c10)
   changed: (value c10) from 52 to 59
   goals met: 6 of 10
61. (increment c10)
   changed: (value c10) from 59 to 66
   goals met: 6 of 10
62. (increment c10)
   changed: (value c10) from 66 to 73
   goals met: 6 of 10
63. (increment c10)
   changed: (value c10) from 73 to 80
   goals met: 6 of 10
64. (increment c10)
   changed: (value c10) from 80 to 87
   goals met: 7 of 10
65. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 10
66. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 7 of 10
67. (increment c8)
   changed: (value c8) from 36 to 44
   goals met: 7 of 10
68. (increment c8)
   changed: (value c8) from 44 to 52
   goals met: 7 of 10
69. (increment c8)
   changed: (value c8) from 52 to 60
   goals met: 7 of 10
70. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 10
71. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 10
72. (increment c8)
   changed: (value c8) from 60 to 68
   goals met: 7 of 10
73. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 7 of 10
74. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 7 of 10
75. (increment c8)
   changed: (value c8) from 68 to 78
   goals met: 7 of 10
76. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 7 of 10
77. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 7 of 10
78. (increment c6)
   changed: (value c6) from 13 to 22
   goals met: 7 of 10
79. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 7 of 10
80. (increment c6)
   changed: (value c6) from 22 to 32
   goals met: 7 of 10
81. (increment c6)
   changed: (value c6) from 32 to 42
   goals met: 7 of 10
82. (increment c6)
   changed: (value c6) from 42 to 52
   goals met: 7 of 10
83. (increment c6)
   changed: (value c6) from 52 to 62
   goals met: 7 of 10
84. (increment c6)
   changed: (value c6) from 62 to 72
   goals met: 7 of 10
85. (increment c6)
   changed: (value c6) from 72 to 82
   goals met: 7 of 10
86. (increment c8)
   changed: (value c8) from 78 to 88
   goals met: 6 of 10
87. (increment c9)
   changed: (value c9) from 86 to 89
   goals met: 6 of 10
88. (increment c10)
   changed: (value c10) from 87 to 94
   goals met: 7 of 10
89. (decrement c7)
   changed: (value c7) from 89 to 87
   goals met: 8 of 10
90. (increment c1)
   changed: (value c1) from 30 to 37
   goals met: 7 of 10
91. (increment c2)
   changed: (value c2) from 31 to 36
   goals met: 7 of 10
92. (increment c2)
   changed: (value c2) from 36 to 41
   goals met: 8 of 10
93. (decrement c0)
   changed: (value c0) from 38 to 36
   goals met: 9 of 10
94. (increment c6)
   changed: (value c6) from 82 to 92
   goals met: 9 of 10
95. (increment c7)
   changed: (value c7) from 87 to 89
   goals met: 8 of 10
96. (increment c8)
   changed: (value c8) from 88 to 98
   goals met: 8 of 10
97. (increment c9)
   changed: (value c9) from 89 to 92
   goals met: 8 of 10
98. (increment c9)
   changed: (value c9) from 92 to 95
   goals met: 7 of 10
99. (increment c9)
   changed: (value c9) from 95 to 98
   goals met: 7 of 10
100. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 7 of 10
101. (increment c7)
   changed: (value c7) from 89 to 91
   goals met: 7 of 10
102. (increment c7)
   changed: (value c7) from 91 to 93
   goals met: 8 of 10
103. (decrement c10)
   changed: (value c10) from 94 to 86
   goals met: 8 of 10
104. (decrement c9)
   changed: (value c9) from 98 to 95
   goals met: 8 of 10
105. (decrement c9)
   changed: (value c9) from 95 to 92
   goals met: 8 of 10
106. (decrement c9)
   changed: (value c9) from 92 to 89
   goals met: 8 of 10
107. (decrement c9)
   changed: (value c9) from 89 to 86
   goals met: 8 of 10
108. (decrement c9)
   changed: (value c9) from 86 to 83
   goals met: 9 of 10
109. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 9 of 10
110. (increment c9)
   changed: (value c9) from 83 to 87
   goals met: 8 of 10
111. (increment c10)
   changed: (value c10) from 86 to 94
   goals met: 9 of 10
112. (increment c9)
   changed: (value c9) from 87 to 91
   goals met: 9 of 10
113. (increment c9)
   changed: (value c9) from 91 to 95
   goals met: 8 of 10
114. (increment c9)
   changed: (value c9) from 95 to 99
   goals met: 9 of 10
115. (decrement_rate c10)
   changed: (rate_value c10) from 8 to 7
   goals met: 9 of 10
116. (decrement_rate c10)
   changed: (rate_value c10) from 7 to 6
   goals met: 9 of 10
117. (increment c10)
   changed: (value c10) from 94 to 100
   goals met: 10 of 10
